import json

list_stub = []
list_stub.append({'index': 123, 'stub': 32})
list_stub.append({'Который': 100.0, 'Говорить': 86.61, 'Только': 83.46, 'Чтобы': 66.14, 'Когда': 66.14, 'Человек': 59.84, 'Такой': 58.66, 'Время': 55.91, 'Какой': 52.76, 'Знать': 50.39, 'Здесь': 49.21, 'Теперь': 47.24, 'Каждый': 46.85, 'Снова': 45.67, 'Голова': 45.28, 'Тьяден': 44.09, 'Сейчас': 43.7, 'Другой': 42.52, 'Ничего': 42.13, 'Видеть': 42.13, 'Несколько': 39.76, 'Лежать': 39.37, 'Через': 38.98, 'Большой': 38.19, 'Кроппа': 36.61, 'Затем': 36.22, 'Стать': 35.83, 'Солдат': 35.04, 'Нибыть': 34.65, 'Спрашивать': 33.86, 'Перед': 32.68, 'Земля': 31.5, 'Химмельштос': 31.1, 'Жизнь': 30.71, 'Делать': 30.71, 'Фронт': 29.53, 'Смотреть': 28.74, 'Стоить': 27.95, 'Тогда': 27.95, 'Начинать': 27.56, 'Альберт': 27.17, 'Сидеть': 27.17, 'Становиться': 27.17, 'Можно': 26.77, 'Самый': 26.38, 'Огонь': 26.38, 'Хотеть': 26.38, 'Война': 25.98, 'Сказать': 25.59, 'Казаться': 25.59, 'Снаряд': 24.8, 'Место': 24.41, 'Должный': 24.41, 'Мюллер': 24.02, 'Конец': 24.02, 'Почти': 23.62, 'Очень': 23.62, 'Сторона': 23.62, 'Хороший': 22.44, 'Воронка': 22.05, 'Слово': 21.65, 'Сделать': 21.65, 'Совсем': 21.65, 'Никто': 21.65, 'Просто': 20.87, 'После': 20.47, 'Первый': 19.69, 'Сестра': 19.69, 'Вдруг': 19.29, 'Поэтому': 18.5, 'Всегда': 18.5, 'Более': 18.5, 'Маленький': 18.5, 'Кеммерих': 18.11, 'Остаться': 17.72, 'Некоторый': 17.72, 'Голос': 17.32, 'Слышать': 17.32, 'Стоять': 16.93, 'Думать': 16.93, 'Минута': 16.93, 'Мысль': 16.93, 'Сразу': 16.14, 'Давать': 16.14, 'Больший': 16.14, 'Дверь': 16.14, 'Чувствовать': 16.14, 'Потом': 16.14, 'Вокруг': 15.35, 'Ждать': 14.96, 'Хорошо': 14.96, 'Случай': 14.96, 'Слишком': 14.96, 'Наконец': 14.57, 'Новобранец': 14.57, 'Канторека': 14.57, 'Кричать': 14.57, 'Взять': 14.17, 'Потому': 14.17, 'Приходиться': 14.17})
list_stub.append({'Одиссей': 100.0, 'Сказать': 91.37, 'Корабль': 59.63, 'Человек': 57.01, 'Который': 48.69, 'Здесь': 47.77, 'Когда': 47.61, 'Сердце': 47.15, 'Слово': 44.99, 'Земля': 44.22, 'Другой': 38.37, 'Жених': 38.06, 'Богиня': 37.75, 'Отвечать': 34.82, 'Великий': 34.51, 'Телемах': 34.21, 'Говорить': 33.9, 'Город': 31.9, 'Стать': 28.66, 'Какой': 25.89, 'Теперь': 25.89, 'Возвратиться': 25.42, 'Милый': 25.42, 'Благородный': 24.5, 'Одиссея': 24.35, 'Пенелопа': 24.35, 'Время': 24.19, 'Много': 24.19, 'Остров': 23.73, 'Знать': 23.27, 'Бросить': 22.5, 'Должный': 22.19, 'Гость': 22.19, 'Такой': 21.57, 'Народ': 21.57, 'Каждый': 21.11, 'Тогда': 21.11, 'Увидеть': 20.65, 'Кончить': 20.34, 'Афина': 20.34, 'Пойти': 19.88, 'Видеть': 19.26, 'Взять': 19.26, 'Песня': 18.8, 'Светлый': 18.8, 'После': 18.64, 'Первый': 18.34, 'Прежде': 17.72, 'Выйти': 17.57, 'Смерть': 16.95, 'Потом': 16.64, 'Иметь': 16.33, 'Бессмертный': 15.87, 'Немой': 15.72, 'Однако': 15.56, 'Старец': 15.56, 'Скоро': 15.56, 'Странник': 15.25, 'Хотеть': 15.25, 'Начать': 15.1, 'Голова': 15.1, 'Также': 14.95, 'Супруг': 14.79, 'Могучий': 14.79, 'Рабыня': 14.79, 'Итака': 14.33, 'Никто': 14.33, 'Троить': 14.18, 'Вместе': 14.18, 'Смотреть': 14.18, 'Высокий': 13.87, 'Царица': 13.71, 'Берег': 13.41, 'Товарищ': 13.41, 'Самый': 13.25, 'Отчизна': 13.25, 'Разумный': 13.25, 'Место': 13.1, 'Дверь': 13.1, 'Свинопас': 13.1, 'Приготовить': 12.79, 'Достигнуть': 12.63, 'Добрый': 12.63, 'Принести': 12.63, 'Волна': 12.63, 'Герой': 12.48, 'Только': 12.48, 'Зевес': 12.48, 'Богоравный': 12.48, 'Перед': 12.33, 'Верный': 12.33, 'Рассказать': 12.33, 'Ветер': 12.33, 'Прекрасный': 12.17, 'Погибнуть': 12.17, 'Остаться': 12.02, 'Встретить': 12.02, 'Дорога': 12.02, 'Оставить': 12.02, 'Послать': 12.02})
class stubbedWord:
  content =""
  count = 0

  def __init__(self,content,count) -> None:
    self.content = content
    self.count = count
class stubbedWordJsonSer(json.JSONEncoder):
    def default(self, obj):
        if isinstance(obj, stubbedWord):
            return obj.__dict__
        return json.JSONEncoder.default(self, obj)


def normalize_dict(dict):
  max = list(dict.values())[0]/100
  for item in dict:
    dict.update([(item, (round(dict.get(item) / max, 2)))])

  toRet = list()
  print(toRet)
  for item in dict:
    toRet.append(json.loads(json.dumps(stubbedWord(item,dict.get(item)), cls=stubbedWordJsonSer)))
  print(toRet)
  return toRet
